brmo-stufbg204/src/test/resources/testdata-tnt/StUF_XML_mutaties_serie_1/stuf-bg_201900000029.anon.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--Geanonimiseerd door B3Partners BV op 2019-06-11+02:00, zie commentaar in bericht.-->
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
   <s:Header/>
   <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
           xmlns:xsd="http://www.w3.org/2001/XMLSchema">
      <ns2:kennisgevingsBericht xmlns:ns1="http://www.egem.nl/StUF/StUF0204"
                                xmlns:ns2="http://www.egem.nl/StUF/sector/bg/0204">
         <ns1:stuurgegevens>
            <ns1:berichtsoort>Lk01</ns1:berichtsoort>
            <ns1:entiteittype>PRS</ns1:entiteittype>
            <ns1:sectormodel>BG</ns1:sectormodel>
            <ns1:versieStUF>0204</ns1:versieStUF>
            <ns1:versieSectormodel>0204</ns1:versieSectormodel>
            <ns1:zender>
               <ns1:organisatie>tent</ns1:organisatie>
               <ns1:applicatie>Competent-StUF</ns1:applicatie>
            </ns1:zender>
            <ns1:ontvanger>
               <ns1:organisatie>DeDommel</ns1:organisatie>
               <ns1:applicatie>B3Partners</ns1:applicatie>
            </ns1:ontvanger>
            <ns1:referentienummer>201900000029</ns1:referentienummer>
            <ns1:tijdstipBericht>2019011416034100</ns1:tijdstipBericht>
            <ns1:kennisgeving>
               <ns1:mutatiesoort>W</ns1:mutatiesoort>
               <ns1:indicatorOvername>I</ns1:indicatorOvername>
               <ns1:tijdstipMutatie>2019011416034100</ns1:tijdstipMutatie>
            </ns1:kennisgeving>
         </ns1:stuurgegevens>
         <ns2:body>
            <ns2:PRS soortEntiteit="F" ns1:sleutelVerzendend="9302186546" ns1:verwerkingssoort="I">
               <ns2:a-nummer kerngegeven="true">0789721340</ns2:a-nummer>
               <ns2:bsn-nummer kerngegeven="true">606117644</ns2:bsn-nummer>
               <ns2:voornamen kerngegeven="true" gegevengroep="PRS1">c14d5</ns2:voornamen>
               <ns2:voorletters kerngegeven="true" gegevengroep="PRS1">0</ns2:voorletters>
               <ns2:voorvoegselGeslachtsnaam kerngegeven="true" gegevengroep="PRS1" ns1:noValue="geenWaarde" xsi:nil="true"/>
               <ns2:geslachtsnaam kerngegeven="true" gegevengroep="PRS1">c58b867</ns2:geslachtsnaam>
               <ns2:geboortedatum kerngegeven="true">1964-02-09</ns2:geboortedatum>
               <ns2:geslachtsaanduiding kerngegeven="true">V</ns2:geslachtsaanduiding>
               <ns2:PRSADRVBL soortEntiteit="R" ns1:verwerkingssoort="I">
                  <ns2:tijdvakRelatie>
                     <ns1:begindatumRelatie>20240627</ns1:begindatumRelatie>
                     <ns1:einddatumRelatie ns1:noValue="geenWaarde" xsi:nil="true">19600509</ns1:einddatumRelatie>
                  </ns2:tijdvakRelatie>
                  <ns2:ADR soortEntiteit="F" ns1:verwerkingssoort="I">
                     <ns2:postcode kerngegeven="true" gegevengroep="ADR1">3020RV</ns2:postcode>
                     <ns2:woonplaatsnaam kerngegeven="true" ns1:noValue="geenWaarde" xsi:nil="true"/>
                     <ns2:straatnaam kerngegeven="true" gegevengroep="ADR1">Markt</ns2:straatnaam>
                     <ns2:huisnummer kerngegeven="true" gegevengroep="ADR1">4</ns2:huisnummer>
                     <ns2:huisletter kerngegeven="true" gegevengroep="ADR1" ns1:noValue="geenWaarde" xsi:nil="true"/>
                     <ns2:huisnummertoevoeging kerngegeven="true" gegevengroep="ADR1" ns1:noValue="geenWaarde" xsi:nil="true"/>
                     <ns2:aanduidingBijHuisnummer kerngegeven="true" gegevengroep="ADR1" ns1:noValue="geenWaarde" xsi:nil="true"/>
                     <ns2:locatieomschrijving kerngegeven="true" gegevengroep="ADR1" ns1:noValue="geenWaarde" xsi:nil="true"/>
                     <ns2:locatieadresnummer kerngegeven="true" ns1:noValue="nietOndersteund" xsi:nil="true"/>
                     <ns2:gemeentecode kerngegeven="true">1801</ns2:gemeentecode>
                  </ns2:ADR>
               </ns2:PRSADRVBL>
               <ns2:PRSPRSHUW soortEntiteit="R" ns1:verwerkingssoort="T" ns1:noValue="geenWaarde"
                              xsi:nil="true"/>
            </ns2:PRS>
            <ns2:PRS soortEntiteit="F" ns1:sleutelVerzendend="9302186546" ns1:verwerkingssoort="I">
               <ns2:a-nummer kerngegeven="true">0789721340</ns2:a-nummer>
               <ns2:bsn-nummer kerngegeven="true">606117644</ns2:bsn-nummer>
               <ns2:voornamen kerngegeven="true" gegevengroep="PRS1">c14d5</ns2:voornamen>
               <ns2:voorletters kerngegeven="true" gegevengroep="PRS1">0</ns2:voorletters>
               <ns2:voorvoegselGeslachtsnaam kerngegeven="true" gegevengroep="PRS1" ns1:noValue="geenWaarde" xsi:nil="true"/>
               <ns2:geslachtsnaam kerngegeven="true" gegevengroep="PRS1">c58b867</ns2:geslachtsnaam>
               <ns2:geboortedatum kerngegeven="true">1964-02-09</ns2:geboortedatum>
               <ns2:geslachtsaanduiding kerngegeven="true">V</ns2:geslachtsaanduiding>
               <ns2:PRSADRVBL soortEntiteit="R" ns1:verwerkingssoort="I">
                  <ns2:tijdvakRelatie>
                     <ns1:begindatumRelatie>20240627</ns1:begindatumRelatie>
                     <ns1:einddatumRelatie ns1:noValue="geenWaarde" xsi:nil="true">19600509</ns1:einddatumRelatie>
                  </ns2:tijdvakRelatie>
                  <ns2:ADR soortEntiteit="F" ns1:verwerkingssoort="I">
                     <ns2:postcode kerngegeven="true" gegevengroep="ADR1">3020RV</ns2:postcode>
                     <ns2:woonplaatsnaam kerngegeven="true" ns1:noValue="geenWaarde" xsi:nil="true"/>
                     <ns2:straatnaam kerngegeven="true" gegevengroep="ADR1">Markt</ns2:straatnaam>
                     <ns2:huisnummer kerngegeven="true" gegevengroep="ADR1">4</ns2:huisnummer>
                     <ns2:huisletter kerngegeven="true" gegevengroep="ADR1" ns1:noValue="geenWaarde" xsi:nil="true"/>
                     <ns2:huisnummertoevoeging kerngegeven="true" gegevengroep="ADR1" ns1:noValue="geenWaarde" xsi:nil="true"/>
                     <ns2:aanduidingBijHuisnummer kerngegeven="true" gegevengroep="ADR1" ns1:noValue="geenWaarde" xsi:nil="true"/>
                     <ns2:locatieomschrijving kerngegeven="true" gegevengroep="ADR1" ns1:noValue="geenWaarde" xsi:nil="true"/>
                     <ns2:locatieadresnummer kerngegeven="true" ns1:noValue="nietOndersteund" xsi:nil="true"/>
                     <ns2:gemeentecode kerngegeven="true">1801</ns2:gemeentecode>
                  </ns2:ADR>
               </ns2:PRSADRVBL>
               <ns2:PRSPRSHUW soortEntiteit="R" ns1:verwerkingssoort="T">
                  <ns2:datumSluiting>20110526</ns2:datumSluiting>
                  <ns2:tijdvakRelatie>
                     <ns1:begindatumRelatie>20240430</ns1:begindatumRelatie>
                     <ns1:einddatumRelatie ns1:noValue="geenWaarde" xsi:nil="true">19600509</ns1:einddatumRelatie>
                  </ns2:tijdvakRelatie>
                  <ns2:PRS soortEntiteit="F" ns1:verwerkingssoort="T">
                     <ns2:a-nummer kerngegeven="true" ns1:noValue="geenWaarde" xsi:nil="true"/>
                     <ns2:bsn-nummer kerngegeven="true" ns1:noValue="geenWaarde" xsi:nil="true"/>
                     <ns2:voornamen kerngegeven="true" gegevengroep="PRS1" ns1:noValue="nietGeautoriseerd"
                                    xsi:nil="true"/>
                     <ns2:voorletters kerngegeven="true" gegevengroep="PRS1" ns1:noValue="nietGeautoriseerd"
                                      xsi:nil="true"/>
                     <ns2:voorvoegselGeslachtsnaam kerngegeven="true" gegevengroep="PRS1">95</ns2:voorvoegselGeslachtsnaam>
                     <ns2:geslachtsnaam kerngegeven="true" gegevengroep="PRS1">952f9c9ff</ns2:geslachtsnaam>
                     <ns2:geboortedatum kerngegeven="true" ns1:noValue="nietGeautoriseerd" xsi:nil="true">1960-05-09</ns2:geboortedatum>
                     <ns2:geslachtsaanduiding kerngegeven="true" ns1:noValue="nietGeautoriseerd" xsi:nil="true"/>
                  </ns2:PRS>
               </ns2:PRSPRSHUW>
            </ns2:PRS>
         </ns2:body>
      </ns2:kennisgevingsBericht>
   </s:Body>
</s:Envelope>